/*_____________________________________________________________________
*|
*| 制作者：　和田拓実
*| 作成日：　2017/2/19
*| 概　要：　ボスが撃つ弾の処理
*| スクリプト名：　BossBulletMovement.cs
*|
*| Copylight ©2017 TAKUMI WADA ALL Right Reserved
*|____________________________________________________________________*/
//---------------------------------------------------------------------------------------------
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

//---------------------------------------------------------------------------------------------
public class BossBulletsMovement : MonoBehaviour {

    public int speed;
    public float lifeTime;

    /*---------------------------------------------------------------------------------------------
    *| 概　要：　初期化処理
    *--------------------------------------------------------------------------------------------*/
    void Start()
    {
        // 下方向に移動
        GetComponent<Rigidbody2D>().velocity = transform.up.normalized * -speed;
        // lifeTime秒後に削除
        Destroy(gameObject, lifeTime);
    }   
}

//---------------------------------------------------------------------------------------------